{"meta":{"title":"Drfuze_blog","subtitle":null,"description":null,"author":"ZE FU","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"my_second_blog","slug":"my-second-blog","date":"2019-08-12T04:48:54.000Z","updated":"2019-08-12T04:51:05.095Z","comments":true,"path":"2019/08/12/my-second-blog/","link":"","permalink":"http://yoursite.com/2019/08/12/my-second-blog/","excerpt":"","text":"打开文档在文档列表里单击某篇文档，则对应的文档会被打开。如果想让打开文档的获取录入焦点以便开始编辑，可以双击该文档，则对应的编辑器会获得焦点。当然也可以单击该文档的标签页让编辑器获得焦点。 任务管理Yu Writer 内置了简单的任务管理功能。 截稿日期（Due）你可以为一篇文档设置截稿日期，设置之后会在文档列表里会显示剩余的天数，随着天数的临近还会以不同颜色醒目显示。 要为文档设置截稿日期，在文档列表里右击文档，然后在弹出菜单中选择 设置截稿日期，再输入剩余的天数或者选择准确的日期即可。 你可以通过智能文件夹 Due 列出设置了截稿日期的文档。另外，当软件每次启动时，会在窗口右下角弹出消息，提醒有哪些文档快到截稿日期（此功能尚未完成）。 任务列表（Task List/TODO List）你可以在文档任意位置输入任务列表（也叫待办事项），包含有任务列表的文档会在文档列表里显示一个百分比进度条。你可以通过智能文件夹 Task 列出所有包含任务列表的文档。 写作目标在编辑文档时，窗口下方的状态栏会显示该文档的实时字数统计以及文字录入总时长，点击它会弹出详细的统计信息窗口（你也可以通过菜单 文件 &gt; 统计信息 呼出这个窗口），在这个窗口里你可以设定目标字数。设置之后，在统计信息窗口和状态栏都会实时显示已完成的百分比，由此你可以了解写作进度。","categories":[],"tags":[]},{"title":"My new post","slug":"My-new-post","date":"2019-08-12T04:35:31.000Z","updated":"2019-08-12T04:53:50.797Z","comments":true,"path":"2019/08/12/My-new-post/","link":"","permalink":"http://yoursite.com/2019/08/12/My-new-post/","excerpt":"","text":"A10 拼写检查使用拼写检查功能可以初步地排除单词的拼写错误，目前仅支持英文的拼写检查。 打开拼写检查功能默认情况下拼写检查功能是关闭的，要打开此项功能，需要到设置里勾选上 “启用拼写检查”。 检查结果的标识拼写检查是实时进行的，在录入文字过程中，如果出现灰色的下波浪线，则表示该单词可能存在拼写错误，当然因为此时可能单词还没录入完整，所以可以忽略灰色的下波浪线。 当单词录入完成，或者文档已书写完毕，如果某些单词存在拼写错误，则会出现红色的下波浪线。 自动更正右击带有红色下波浪线的单词，在弹出菜单里会显示 3 个修正建议，如果其中有你认为正确的，点击它则会帮你自动替换掉错误的单词。 除了右击拼写错误的单词，还可以将光标移到该单词之中的任意位置，按快捷键 Shift+Ctrl+空格 它会尝试自动更正。 生词本字典对于技术文档，可能会存在很多专业名词，拼写检查可能会把它们标识为拼写错误。如果觉得通篇有大量红色下波浪线有碍于阅读，你可以右击这些单词，然后选择 Add to dictionary 把它们加入到生词本字典，以后拼写检查就会忽略这个单词了。 禁用拼写检查功能如果英文不是你的主要语言，或者觉得拼写检查没什么作用，则可以考虑在设置里把拼写检查功能禁用。","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2019-08-12T04:09:12.275Z","updated":"2019-08-12T04:09:12.275Z","comments":true,"path":"2019/08/12/hello-world/","link":"","permalink":"http://yoursite.com/2019/08/12/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}